; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	spectrograph0 - mode
	thermograph2 - mode
	image1 - mode
	infrared3 - mode
	GroundStation1 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	Star2 - direction
	Star3 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Planet13 - direction
	Planet14 - direction
	Star15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Star18 - direction
	Star19 - direction
	Planet20 - direction
	Planet21 - direction
	Planet22 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 image1)
	(calibration_target instrument0 Star3)
	(supports instrument1 infrared3)
	(supports instrument1 image1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star16)
	(supports instrument3 thermograph2)
	(supports instrument3 image1)
	(supports instrument3 infrared3)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet6)
	(supports instrument4 thermograph2)
	(supports instrument4 infrared3)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 spectrograph0)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 Star3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet13)
	(supports instrument7 spectrograph0)
	(supports instrument7 infrared3)
	(calibration_target instrument7 GroundStation0)
	(supports instrument8 infrared3)
	(supports instrument8 thermograph2)
	(supports instrument8 spectrograph0)
	(calibration_target instrument8 Star3)
	(supports instrument9 image1)
	(supports instrument9 spectrograph0)
	(calibration_target instrument9 GroundStation0)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star18)
	(supports instrument10 thermograph2)
	(calibration_target instrument10 GroundStation4)
	(supports instrument11 infrared3)
	(calibration_target instrument11 Star2)
	(supports instrument12 infrared3)
	(supports instrument12 image1)
	(supports instrument12 thermograph2)
	(calibration_target instrument12 Star3)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet14)
)
(:goal (and
	(pointing satellite0 Planet6)
	(pointing satellite1 GroundStation0)
	(pointing satellite4 Star2)
	(have_image Star5 spectrograph0)
	(have_image Planet6 image1)
	(have_image Star7 infrared3)
	(have_image Star8 image1)
	(have_image Phenomenon9 infrared3)
	(have_image Phenomenon10 infrared3)
	(have_image Phenomenon11 infrared3)
	(have_image Star12 thermograph2)
	(have_image Planet13 infrared3)
	(have_image Planet14 image1)
	(have_image Star15 image1)
	(have_image Star16 image1)
	(have_image Phenomenon17 thermograph2)
	(have_image Star18 thermograph2)
	(have_image Star19 spectrograph0)
	(have_image Planet20 spectrograph0)
	(have_image Planet21 thermograph2)
	(have_image Planet22 infrared3)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 21
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 21
3. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 21
4. (turn_to satellite4 star2 planet14)
   deleted: (pointing satellite4 planet14)
   added: (pointing satellite4 star2)
   goals met: 1 of 21
5. (turn_to satellite2 groundstation1 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 groundstation1)
   goals met: 1 of 21
6. (calibrate satellite2 instrument4 groundstation1)
   added: (calibrated instrument4)
   goals met: 1 of 21
7. (turn_to satellite2 phenomenon10 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon10)
   goals met: 1 of 21
8. (take_image satellite2 phenomenon10 instrument4 infrared3)
   added: (have_image phenomenon10 infrared3)
   goals met: 2 of 21
9. (turn_to satellite2 phenomenon11 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 phenomenon11)
   goals met: 2 of 21
10. (take_image satellite2 phenomenon11 instrument4 infrared3)
   added: (have_image phenomenon11 infrared3)
   goals met: 3 of 21
11. (turn_to satellite2 phenomenon17 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 phenomenon17)
   goals met: 3 of 21
12. (take_image satellite2 phenomenon17 instrument4 thermograph2)
   added: (have_image phenomenon17 thermograph2)
   goals met: 4 of 21
13. (turn_to satellite2 phenomenon9 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 phenomenon9)
   goals met: 4 of 21
14. (take_image satellite2 phenomenon9 instrument4 infrared3)
   added: (have_image phenomenon9 infrared3)
   goals met: 5 of 21
15. (turn_to satellite2 planet13 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 planet13)
   goals met: 5 of 21
16. (take_image satellite2 planet13 instrument4 infrared3)
   added: (have_image planet13 infrared3)
   goals met: 6 of 21
17. (turn_to satellite2 planet20 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 planet20)
   goals met: 6 of 21
18. (take_image satellite2 planet20 instrument4 spectrograph0)
   added: (have_image planet20 spectrograph0)
   goals met: 7 of 21
19. (turn_to satellite2 planet21 planet20)
   deleted: (pointing satellite2 planet20)
   added: (pointing satellite2 planet21)
   goals met: 7 of 21
20. (take_image satellite2 planet21 instrument4 thermograph2)
   added: (have_image planet21 thermograph2)
   goals met: 8 of 21
21. (turn_to satellite2 planet22 planet21)
   deleted: (pointing satellite2 planet21)
   added: (pointing satellite2 planet22)
   goals met: 8 of 21
22. (take_image satellite2 planet22 instrument4 infrared3)
   added: (have_image planet22 infrared3)
   goals met: 9 of 21
23. (turn_to satellite2 star12 planet22)
   deleted: (pointing satellite2 planet22)
   added: (pointing satellite2 star12)
   goals met: 9 of 21
24. (take_image satellite2 star12 instrument4 thermograph2)
   added: (have_image star12 thermograph2)
   goals met: 10 of 21
25. (turn_to satellite2 star18 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 star18)
   goals met: 10 of 21
26. (take_image satellite2 star18 instrument4 thermograph2)
   added: (have_image star18 thermograph2)
   goals met: 11 of 21
27. (turn_to satellite2 star19 star18)
   deleted: (pointing satellite2 star18)
   added: (pointing satellite2 star19)
   goals met: 11 of 21
28. (take_image satellite2 star19 instrument4 spectrograph0)
   added: (have_image star19 spectrograph0)
   goals met: 12 of 21
29. (turn_to satellite2 star5 star19)
   deleted: (pointing satellite2 star19)
   added: (pointing satellite2 star5)
   goals met: 12 of 21
30. (take_image satellite2 star5 instrument4 spectrograph0)
   added: (have_image star5 spectrograph0)
   goals met: 13 of 21
31. (turn_to satellite2 star7 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 star7)
   goals met: 13 of 21
32. (take_image satellite2 star7 instrument4 infrared3)
   added: (have_image star7 infrared3)
   goals met: 14 of 21
33. (turn_to satellite1 groundstation4 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 groundstation4)
   goals met: 14 of 21
34. (calibrate satellite1 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 14 of 21
35. (turn_to satellite1 groundstation0 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 groundstation0)
   goals met: 15 of 21
36. (turn_to satellite0 planet6 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 planet6)
   goals met: 16 of 21
37. (turn_to satellite1 planet14 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet14)
   goals met: 15 of 21
38. (take_image satellite1 planet14 instrument3 image1)
   added: (have_image planet14 image1)
   goals met: 16 of 21
39. (turn_to satellite1 groundstation0 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 groundstation0)
   goals met: 17 of 21
40. (turn_to satellite1 planet6 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet6)
   goals met: 16 of 21
41. (take_image satellite1 planet6 instrument3 image1)
   added: (have_image planet6 image1)
   goals met: 17 of 21
42. (turn_to satellite1 groundstation0 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 groundstation0)
   goals met: 18 of 21
43. (turn_to satellite1 star15 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star15)
   goals met: 17 of 21
44. (take_image satellite1 star15 instrument3 image1)
   added: (have_image star15 image1)
   goals met: 18 of 21
45. (turn_to satellite1 groundstation0 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 groundstation0)
   goals met: 19 of 21
46. (turn_to satellite1 star16 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star16)
   goals met: 18 of 21
47. (take_image satellite1 star16 instrument3 image1)
   added: (have_image star16 image1)
   goals met: 19 of 21
48. (turn_to satellite1 groundstation0 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 groundstation0)
   goals met: 20 of 21
49. (turn_to satellite1 star8 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star8)
   goals met: 19 of 21
50. (take_image satellite1 star8 instrument3 image1)
   added: (have_image star8 image1)
   goals met: 20 of 21
51. (turn_to satellite1 groundstation0 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 groundstation0)
   goals met: 21 of 21
